# Ultralytics YOLO 🚀, AGPL-3.0 license
# Custom YOLO11 with C2EMA (Multi-Scale Cross-Axis Attention block)
# Total 5 Attention modules as specified in the architecture

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2  -> 64
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4  -> 128
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2 -> 256
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8  -> 256
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 -> 512
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16 -> 512
  - [-1, 2, C3k2, [512, True]]    # 6 -> 512
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32 -> 1024
  - [-1, 2, C3k2, [1024, True]]   # 8 -> 1024
  - [-1, 1, SPPF, [1024, 5]]      # 9 -> 1024
  - [-1, 2, C2PSA, [1024]]        # 10 -> 1024
  - [-1, 1, C2EMA, [1024, 1]]   # 11 - Attention #1

# Head
head:
  # FPN path (top-down)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 -> 1024
  - [[-1, 6], 1, Concat, [1]]      # 13 cat (1024+512=1536)
  - [-1, 2, C3k2, [512, False]]    # 14 -> 512
  - [-1, 1, C2EMA, [512, 1]]     # 15 - Attention #2
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16 -> 512
  - [[-1, 4], 1, Concat, [1]]      # 17 cat (512+512=1024)
  - [-1, 2, C3k2, [256, False]]    # 18 -> 256
  - [-1, 1, C2EMA, [256, 1]]     # 19 - Attention #3

  # PAN path (bottom-up)
  - [-1, 1, Conv, [256, 3, 2]]     # 20 -> 256
  - [[-1, 14], 1, Concat, [1]]     # 21 cat (256+512=768)
  - [-1, 2, C3k2, [512, False]]    # 22 -> 512
  - [-1, 1, C2EMA, [512, 1]]     # 23 - Attention #4

  - [-1, 1, Conv, [512, 3, 2]]     # 24 -> 512
  - [[-1, 11], 1, Concat, [1]]     # 25 cat (512+1024=1536)
  - [-1, 2, C3k2, [1024, True]]    # 26 -> 1024
  - [-1, 1, C2EMA, [1024, 1]]   # 27 - Attention #5

  # Segmentation head
  - [[19, 23, 27], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
